#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ElettroAle/shared-infrastructure/runs/run-6vC87YRSgU1aQgzu

Waiting for the plan to start...

Terraform v1.3.6
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster]
module.cluster.azurerm_kubernetes_cluster.aks: Refreshing state... [id=/subscriptions/4340d382-f8e5-4753-a006-da8cbc11955a/resourceGroups/rg-cluster/providers/Microsoft.ContainerService/managedClusters/aks-cluster-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cluster.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + login_server                  = (known after apply)
      + name                          = "crclusterprod"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-cluster"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.cluster.azurerm_role_assignment.rbac will be created
  + resource "azurerm_role_assignment" "rbac" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "966794e4-c30c-4614-a85f-62840a18b9a3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @ElettroAle, Action: `pull_request`*